// Задача №0
// Напишите программу, которая на вход принимает
// число и выдаёт его квадрат (число умноженное на
// само себя).

// Console.WriteLine("Please enter number");
// // считаем данные с консоли 
// string? inputNum = Console.ReadLine();
//  // ??"0";
// // проверям, чтобы данные были не пустыми
// if(inputNum!=null)
// {
//     //парсим выделенное число 
//     int num = int.Parse(inputNum);
//     // находим квадрат числа
//     int result = num*num;
//     // выводим данные в косоль
//     Console.WriteLine(result);

// }
// Console.WriteLine("квадрат числа: "+(int)Math.Pow(int.Parse(inputNum),2));

// Задача №1
// Напишите программу, которая на вход принимает
// два числа и проверяет, является ли первое число
// квадратом второго.

// Вводим два числа
// int NumA = int.Parse(Console.ReadLine()??"0");
// int NumB = int.Parse(Console.ReadLine()??"0");

// // Проверяем число на квадрат и задаем если квадрат выводим да 
// if(NumA*NumA == NumB)
// {
//     Console.WriteLine("Yes");
// }
// // условие если нет то выводим как нет
// else
//     {
//         Console.WriteLine("No");
//     }